-- @author: qianye@droi.com
-- @brief:  错误代码及错误信息

local ERROR_INFO = {
    [-20000] = "服务器内部错误",
    [-20001] = "服务不可用",
    [-20002] = "HTTP方法不支持",
    [-20003] = "请求参数不得为空",
    [-20004] = "请求参数解析错误",
    [-20005] = "请求参数错误",
    [-20006] = "数据库连接错误",
    [-20007] = "APPID不存在",
    [-20008] = "比率配置数据库读取错误",
    [-20009] = "APP签名未设置",
    [-20010] = "APP签名不匹配",
    [-20011] = "APP秘钥未设置",
    [-20012] = "参数校验失败",
    [-20013] = "返回参数错误",
    [-20014] = "JSON解析错误",
    [-20015] = "JSON编码错误",
    [-20016] = "邀请码未找到",
    [-20017] = "用户不存在",
    [-20018] = "该用户在当前APP里已设置过师傅",
    [-20019] = "内部操作失败",
    [-20020] = "余额不足",
    [-20021] = "未知货币类型",
    [-20022] = "该订单号已经完成",
    [-20023] = "自己不能做自己的师傅",
};

return ERROR_INFO
